"""
Вихідні дані для соціометрії
----------------------------
"""

MALE = 'Чоловік'
FEMALE = 'Жінка'

PUPILS = [
    {
        'name': 'Бичков Олег',
        'answers': ['П', 'Ж', 'И', 'Є'],
        'code': 'А',
        'sex': MALE
    },
    {
        'name': 'Горшкова Ольга',
        'answers': ['А', 'О', 'У', 'О'],
        'code': 'Б',
        'sex': FEMALE
    },
    {
        'name': 'Густов Максим',
        'answers': ['Л', 'Г', 'Л', 'Г'],
        'code': 'В',
        'sex': MALE
    },
    {
        'name': 'Гуторович Вероніка',
        'answers': ['К', 'И', 'Т', 'Ф'],
        'code': 'Г',
        'sex': FEMALE
    },
    {
        'name': 'Добрянський Олександр',
        'answers': ['Х', 'О', 'Х', 'О'],
        'code': 'Ґ',
        'sex': MALE
    },
    {
        'name': 'Каленюк Юлія',
        'answers': ['Ж', 'Ф', 'Ж', 'Ф'],
        'code': 'Д',
        'sex': FEMALE
    },
    {
        'name': 'Колодій Владислав',
        'answers': ['П', 'К', 'В', 'К'],
        'code': 'Е',
        'sex': MALE
    },
    {
        'name': 'Корзун Рома',
        'answers': ['В', 'К', 'Н', 'Ч'],
        'code': 'Є',
        'sex': MALE
    },
    {
        'name': 'Кравчук Софія',
        'answers': ['Н', 'Р', 'Ж', 'Р'],
        'code': 'Ж',
        'sex': FEMALE
    },
    {
        'name': 'Краснощока Вікторія',
        'answers': ['Д', 'К', 'Л', 'Ш'],
        'code': 'З',
        'sex': FEMALE
    },
    {
        'name': 'Ляшенко Олександр',
        'answers': ['П', 'К', 'Н', 'Є'],
        'code': 'И',
        'sex': MALE
    },
    {
        'name': 'Михайловська Катерина',
        'answers': ['К', 'Ф', 'М', 'З'],
        'code': 'І',
        'sex': FEMALE
    },
    {
        'name': 'Огородник В’ячеслав',
        'answers': ['М', 'К', 'М', 'М'],
        'code': 'Ї',
        'sex': MALE
    },
    {
        'name': 'Омелянова Анна',
        'answers': ['Ч', 'Ї', 'Ч', 'Ї'],
        'code': 'Й',
        'sex': FEMALE
    },
    {
        'name': 'Осадчук Віталій',
        'answers': ['Д', 'Е', 'К', 'О'],
        'code': 'К',
        'sex': MALE
    },
    {
        'name': 'Петренко Крістіна ',
        'answers': ['Й', 'К', 'Щ', 'А'],
        'code': 'Л',
        'sex': FEMALE
    },
    {
        'name': 'Побережець Євгеній',
        'answers': ['Д', 'П', 'Д', 'Й'],
        'code': 'М',
        'sex': MALE
    },
    {
        'name': 'Проценко Ксенія',
        'answers': ['Д', 'К', 'Р', 'К'],
        'code': 'Н',
        'sex': FEMALE
    },
    {
        'name': 'Радзієвська Марія',
        'answers': ['Н', 'О', 'У', 'О'],
        'code': 'О',
        'sex': FEMALE
    },
    {
        'name': 'Самойлова Вероніка',
        'answers': ['А', 'Д', 'А', 'Д'],
        'code': 'П',
        'sex': FEMALE
    },
    {
        'name': 'Скрипченко Дмитро',
        'answers': ['Ф', 'Ж', 'Ф', 'Й'],
        'code': 'Р',
        'sex': MALE
    },
    {
        'name': 'Слесаренко Олександр',
        'answers': ['Г', 'Ж', 'Е', 'Ф'],
        'code': 'С',
        'sex': MALE
    },
    {
        'name': 'Соловей Олександр',
        'answers': ['Д', 'Ї', 'О', 'Ї'],
        'code': 'Т',
        'sex': MALE
    },
    {
        'name': 'Царюк Олександр',
        'answers': ['М', 'Е', 'М', 'Н'],
        'code': 'У',
        'sex': MALE
    },
    {
        'name': 'Чернишук Анна',
        'answers': ['Г', 'Д', 'Ґ', 'Є'],
        'code': 'Ф',
        'sex': FEMALE
    },
    {
        'name': 'Чорний Артем',
        'answers': ['М', 'Ж', 'Ц', 'Ж'],
        'code': 'Х',
        'sex': MALE
    },
    {
        'name': 'Шевчук Костянтин',
        'answers': ['І', 'Н', 'Т', 'Є'],
        'code': 'Ц',
        'sex': MALE
    },
    {
        'name': 'Шкута Вікторія',
        'answers': ['П', 'Ї', 'Д', 'Ф'],
        'code': 'Ч',
        'sex': FEMALE
    },
    {
        'name': 'Юрасов Ілля',
        'answers': ['Б', 'К', 'Б', 'Ч'],
        'code': 'Ш',
        'sex': MALE
    },
    {
        'name': 'Юркіна Ольга',
        'answers': ['Д', 'Ї', 'Й', 'Ї'],
        'code': 'Щ',
        'sex': FEMALE
    }
]
